Backend/customer_service/load-test.yml
config:
  target: 'http://localhost:3000/customers'
  phases:
    # Phase 1 : Échauffement progressif
    - duration: 40
      arrivalRate: 2
      rampTo: 12
      name: Warm up phase
    # Phase 2 : Charge modérée
    - duration: 30
      arrivalRate: 5
      rampTo: 15
      name: Ramp up load
    # Phase 3 : Charge de pointe raisonnable
    - duration: 60
      arrivalRate: 5
      rampTo: 25
      name: Spike phase
  plugins:
    ensure: {}
    metrics-by-endpoint: {}
    apdex: {}

  apdex:
    threshold: 500
  ensure:
    maxErrorRate: 0.01
    thresholds:
      - http.response_time.p99: 850
      - http.response_time.p95: 500 
  
scenarios:
  - flow:
      - loop: 
          - get:
              url: '/paginate'
              headers:
                Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImpvcmRhbkBzb2x1dGlvbi1sb2dpcXVlLmZyIiwic3ViIjoxLCJpYXQiOjE3MzM3MzIxOTksImV4cCI6MTc2OTczMjE5OX0.B_UmypuQ1-O-lYtfUCfdhhloqPNXoStFqEm5PzEt2cY'
              qs:
                email: 'test@example.com'
                limit: 10
                offset: 0
          - get:
              url: '/STRM'
              headers:
                Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImpvcmRhbkBzb2x1dGlvbi1sb2dpcXVlLmZyIiwic3ViIjoxLCJpYXQiOjE3MzM3MzIxOTksImV4cCI6MTc2OTczMjE5OX0.B_UmypuQ1-O-lYtfUCfdhhloqPNXoStFqEm5PzEt2cY'
        count: 100